INSERT INTO `user` VALUES
(1,'admin','admin@gmail.com','ADMIN',null,null,null,'I am the admin.'),
(2,'wkz','2066378882@qq.com','GUEST','Kunzhen','Wu','18659139776','有时候，如果你有了一个疯狂的想法，那么它就值得去实现。'),
(3,'hm','1111111111@qq.com','GUEST', 'Wentao','He','11111111111','666');


INSERT INTO `user_auth` VALUES
(1,'admin'),
(2,'868788'),
(3,'123456');

INSERT INTO `book` VALUES
(1,'bookImage/1.jpg','神经网络与机器学习','（美）Simon Haykin',7200,'计算机科学与技术', '9787111324133', 100),
(2,'bookImage/2.jpg','现代软件工程','（美）Steve McConnell',8900,'计算机科学与技术', '9787111674641', 100),
(3,'bookImage/3.jpg','Java语言程序设计','（美）James Gosling',5600,'计算机科学与技术', '9787111506904', 100),
(4,'bookImage/4.jpg','云计算','（美）Michael Miller',9800,'计算机科学与技术', '9787111461340', 100),
(5,'bookImage/5.jpg','基于EEG的脑机设计','（美）Jonathan Wolpaw',6700,'计算机科学与技术', '9787111694533', 100),
(6,'bookImage/6.jpg','机器学习','（美）Tom M. Mitchell',5200,'计算机科学与技术', '9787111692577', 100),
(7,'bookImage/7.jpg','概率数据结构预算法','（美）Michael Mitzenmacher',7600,'计算机科学与技术', '9787111127482', 100),
(8,'bookImage/8.jpg','计算机网络 自顶向下分解','（美）James F. Kurose',6100,'计算机科学与技术', '9787111127483', 100),
(9,'bookImage/9.jpg','TCP/IP详解','（美）W. Richard Stevens',9300,'计算机科学与技术', '9787111127485', 100),
(10,'bookImage/10.jpg','深入了解计算机系统','（美）Randal E. Bryant',8400,'计算机科学与技术', '9787111127486', 100),
(11,'bookImage/11.jpg','计算机组成原理','（美）David A. Patterson',6900,'���算机科学与技术', '9787111127488', 100),
(12,'bookImage/12.jpg','数据库系统','（美）Hector Garcia-Molina',7800,'计算机科学与技术', '9787111127489', 100),
(13,'bookImage/13.jpg','嵌入式系统','（美）Raj Kamal',7100,'计算机科学与技术', '9787111127582', 100),
(14,'bookImage/14.jpg','操作系统概念','（美）Abraham Silberschatz',9100,'计算机科学与技术', '9787111127682', 100),
(15,'bookImage/15.jpg','数据挖掘导论','（美）Michael Steinbach',6500,'计算机科学与技术', '9787111127782', 100),
(16,'bookImage/16.jpg','离散数学及其应用','（美）Kenneth H. Rosen',8700,'计算机科学与技术', '9787111127982', 100);

INSERT INTO `order` VALUES
(1,2,'2020-06-01 12:00:00', 10000),
(2,2,'2020-06-02 12:00:00', 20000),
(3,2,'2020-06-03 12:00:00', 30000),
(4,2,'2024-06-03 12:00:00', 30000),
(5,2,'2024-06-04 13:05:36', 12550),
(6,3,'2024-06-05 08:33:11', 8900),
(7,3,'2024-06-06 09:33:11', 8900),
(8,3,'2024-06-07 10:33:11', 18900),
(9,3,'2024-06-08 11:33:11', 25000);

INSERT INTO `order_item` VALUES
(1,1,1,1,'已发货'),
(2,1,2,2,'已发货'),
(3,1,3,3,'已发货'),
(4,2,4,4,'已发货'),
(5,2,5,5,'已发货'),
(6,3,6,6,'已发货'),
(7,3,7,7,'已发货'),
(8,3,8,8,'已发货'),
(9,3,9,9,'已发货'),
(10,4,10,10,'已发货'),
(11,5,11,11,'已发货'),
(12,6,12,12,'已发货'),
(13,7,13,13,'已发货'),
(14,8,14,14,'已发货'),
(15,9,15,15,'已发货');

INSERT INTO `cart` VALUES
(1,2,1,1),
(2,2,2,2),
(3,2,3,3),
(4,2,4,4),
(5,2,5,5),
(6,3,6,6),
(7,3,7,7),
(8,3,8,8),
(9,3,9,9);



